{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Prepend",
        "prepend": "▁"
      },
      {
        "type": "Replace",
        "pattern": {
          "String": " "
        },
        "content": "▁"
      }
    ]
  },
  "pre_tokenizer": null,
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<s>",
          "type_id": 1
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<s>": {
        "id": "<s>",
        "ids": [
          1
        ],
        "tokens": [
          "<s>"
        ]
      }
    }
  },
  "decoder": {
    "type": "Sequence",
    "decoders": [
      {
        "type": "Replace",
        "pattern": {
          "String": "▁"
        },
        "content": " "
      },
      {
        "type": "ByteFallback"
      },
      {
        "type": "Fuse"
      },
      {
        "type": "Strip",
        "content": " ",
        "start": 1,
        "stop": 0
      }
    ]
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": true,
    "byte_fallback": true,
    "vocab": {
      "<unk>": 0,
      "<s>": 1,
      "</s>": 2,
      "A": 3,
      "C": 4,
      "G": 5,
      "T": 6,
      "AA": 7,
      "TT": 8,
      "TG": 9,
      "CA": 10,
      "CC": 11,
      "TA": 12,
      "GG": 13,
      "TC": 14,
      "GA": 15,
      "AAA": 16,
      "GC": 17,
      "TAA": 18,
      "TTTT": 19,
      "TCA": 20,
      "TGA": 21,
      "TTA": 22,
      "GAA": 23,
      "TCC": 24,
      "CAA": 25,
      "CTG": 26,
      "CTT": 27,
      "GTG": 28,
      "GTT": 29,
      "GCA": 30,
      "GGA": 31,
      "CCA": 32,
      "GTA": 33,
      "GCC": 34,
      "CTA": 35,
      "TAAA": 36,
      "AAAA": 37,
      "CTC": 38,
      "GTC": 39,
      "TGTG": 40,
      "TATT": 41,
      "CACA": 42,
      "GAAA": 43,
      "TATA": 44,
      "TCTT": 45,
      "TGTT": 46,
      "CAAA": 47,
      "GAGA": 48,
      "CATT": 49,
      "TGAA": 50,
      "CAGG": 51,
      "TCTG": 52,
      "CAGA": 53,
      "TCAA": 54,
      "GGAA": 55,
      "TAAAA": 56,
      "CTGA": 57,
      "GCTT": 58,
      "GTGA": 59,
      "GCTG": 60,
      "CTCA": 61,
      "CCTT": 62,
      "CATG": 63,
      "GCAA": 64,
      "GTCA": 65,
      "GTAA": 66,
      "TTTTA": 67,
      "TATG": 68,
      "GAGG": 69,
      "CGG": 70,
      "GATT": 71,
      "CCTG": 72,
      "TCTC": 73,
      "CCAA": 74,
      "GTTA": 75,
      "CTCC": 76,
      "CTAA": 77,
      "TACA": 78,
      "CTTA": 79,
      "TCCA": 80,
      "GATG": 81,
      "TTAA": 82,
      "GAAAA": 83,
      "TTTG": 84,
      "GTTTT": 85,
      "TCTA": 86,
      "GCCA": 87,
      "GTCC": 88,
      "CTTTT": 89,
      "GGGG": 90,
      "CGA": 91,
      "TTTA": 92,
      "CCCA": 93,
      "CAAAA": 94,
      "TGGG": 95,
      "TAGA": 96,
      "TAGG": 97,
      "GACA": 98,
      "GGTT": 99,
      "CCCC": 100,
      "GGTG": 101,
      "CATA": 102,
      "GCTA": 103,
      "TGTA": 104,
      "TCAAA": 105,
      "TGGA": 106,
      "TAATT": 107,
      "TTATT": 108,
      "TGCA": 109,
      "GGCA": 110,
      "GATA": 111,
      "CCTA": 112,
      "TTCA": 113,
      "TCTCA": 114,
      "GGGA": 115,
      "CGC": 116,
      "CTGAA": 117,
      "GTAAA": 118,
      "TCTCC": 119,
      "TTTTTT": 120,
      "CGTG": 121,
      "GCAAA": 122,
      "TAAAAA": 123,
      "TCTGA": 124,
      "TCATT": 125,
      "GGAAA": 126,
      "TGAAA": 127,
      "TCCTT": 128,
      "CCAAA": 129,
      "GAATT": 130,
      "CTAAA": 131,
      "CGTT": 132,
      "GTGAA": 133,
      "GGCC": 134,
      "TAATA": 135,
      "GGTA": 136,
      "TGCC": 137,
      "CACC": 138,
      "TGATT": 139,
      "AAAAAA": 140,
      "GCTCA": 141,
      "TCCAA": 142,
      "GAGAA": 143,
      "CTGTT": 144,
      "TATTA": 145,
      "CAGCA": 146,
      "CTCTT": 147,
      "CTTAA": 148,
      "CAGAA": 149,
      "GCTGA": 150,
      "GTTAA": 151,
      "TCTTA": 152,
      "TATTTT": 153,
      "GCCAA": 154,
      "CTTTG": 155,
      "GACC": 156,
      "CGCA": 157,
      "GTATT": 158,
      "GTCTT": 159,
      "CAATT": 160,
      "GTGTT": 161,
      "CTCAA": 162,
      "GGAGG": 163,
      "CGAA": 164,
      "TCTTTT": 165,
      "GTCAA": 166,
      "CGCC": 167,
      "TATAA": 168,
      "TACC": 169,
      "TCTAA": 170,
      "CCATT": 171,
      "CGGA": 172,
      "CAAAAA": 173,
      "CAGTG": 174,
      "TCCTG": 175,
      "CTCTG": 176,
      "GAAAAA": 177,
      "CTGTG": 178,
      "CAGC": 179,
      "TTTTAA": 180,
      "GCATT": 181,
      "GCCTT": 182,
      "TAATG": 183,
      "CTATT": 184,
      "GTTTG": 185,
      "TGATG": 186,
      "GGCTG": 187,
      "CCTCA": 188,
      "GAGGA": 189,
      "GCCTG": 190,
      "AAATT": 191,
      "CGTA": 192,
      "TCAAAA": 193,
      "TACAA": 194,
      "CATCA": 195,
      "CAGTT": 196,
      "TGAGA": 197,
      "GGGAA": 198,
      "CACTG": 199,
      "CACAA": 200,
      "CAGGA": 201,
      "CCCCA": 202,
      "CCCTG": 203,
      "TTTTTTTT": 204,
      "TAGAA": 205,
      "GAGCA": 206,
      "CCTCC": 207,
      "CACCA": 208,
      "TATCA": 209,
      "GAGC": 210,
      "CATTA": 211,
      "CACACACA": 212,
      "GAGTG": 213,
      "GGATT": 214,
      "TGTGTGTG": 215,
      "TACTT": 216,
      "CACTT": 217,
      "GTCTG": 218,
      "TGAGG": 219,
      "GAGTT": 220,
      "GAATG": 221,
      "TCATG": 222,
      "GACAA": 223,
      "GACTT": 224,
      "TATTAA": 225,
      "TAATAA": 226,
      "GGCCA": 227,
      "CATTTT": 228,
      "CAGCC": 229,
      "CCCTT": 230,
      "GCTAA": 231,
      "TATATATA": 232,
      "GTGTG": 233,
      "TACTG": 234,
      "TAGTT": 235,
      "CAATG": 236,
      "GCTC": 237,
      "CAGTA": 238,
      "GCTCC": 239,
      "CATAA": 240,
      "TTATG": 241,
      "TAAATT": 242,
      "GATGA": 243,
      "CATGA": 244,
      "GCGG": 245,
      "AAAAAAAA": 246,
      "CCATG": 247,
      "GATAA": 248,
      "GACTG": 249,
      "TATGA": 250,
      "GCAGG": 251,
      "GATCA": 252,
      "GTTTTA": 253,
      "GGATG": 254,
      "CCTGA": 255,
      "GTAAAA": 256,
      "GAAGG": 257,
      "GATTA": 258,
      "CCTC": 259,
      "GACCA": 260,
      "GCTTA": 261,
      "CCCAA": 262,
      "AAATG": 263,
      "GCATG": 264,
      "TAGTA": 265,
      "TACCA": 266,
      "GGCTT": 267,
      "CGTC": 268,
      "TCTCTT": 269,
      "GGTCA": 270,
      "TTATTA": 271,
      "TACTA": 272,
      "TAGCA": 273,
      "TATC": 274,
      "CTGGG": 275,
      "CATC": 276,
      "CTTTTA": 277,
      "CTAAAA": 278,
      "GTGGG": 279,
      "GAGTA": 280,
      "CCAGG": 281,
      "GATTTT": 282,
      "TAGTG": 283,
      "GAAATT": 284,
      "CACTA": 285,
      "TCGG": 286,
      "TCAGG": 287,
      "CAGGAA": 288,
      "GCAAAA": 289,
      "CCTTA": 290,
      "CATCC": 291,
      "CTTGG": 292,
      "TGTGAA": 293,
      "TATTTG": 294,
      "CCTAA": 295,
      "CTATG": 296,
      "GAGAAA": 297,
      "GAGAGAGA": 298,
      "GCTTTT": 299,
      "TATAAA": 300,
      "CAAGG": 301,
      "TCTCTG": 302,
      "TGTTAA": 303,
      "TGTGTT": 304,
      "GAGCC": 305,
      "GACTA": 306,
      "TATATT": 307,
      "TAAAAAA": 308,
      "TTTTTG": 309,
      "GTATG": 310,
      "CATTAA": 311,
      "TAGGA": 312,
      "TAGC": 313,
      "GTTGG": 314,
      "GAAGAA": 315,
      "TAAATG": 316,
      "TCTGTT": 317,
      "CAGAAA": 318,
      "CAAATT": 319,
      "TAATTA": 320,
      "TCTGTG": 321,
      "TATCC": 322,
      "TGAATT": 323,
      "CTCCA": 324,
      "GTGAAA": 325,
      "GGCAA": 326,
      "GGAGA": 327,
      "GAAGA": 328,
      "GGTGA": 329,
      "GGGCA": 330,
      "CCAAAA": 331,
      "TCTCTCTC": 332,
      "CTGCA": 333,
      "CTTCTT": 334,
      "TCTTAA": 335,
      "CCCTA": 336,
      "TGTGTG": 337,
      "AAATA": 338,
      "TGTTTG": 339,
      "GGGTT": 340,
      "GTGCTG": 341,
      "GGAAAA": 342,
      "GGGGA": 343,
      "TCAGA": 344,
      "CCTTTT": 345,
      "GAAATG": 346,
      "GCAGCA": 347,
      "TCTGAA": 348,
      "GGGTG": 349,
      "CACATT": 350,
      "TCTTTG": 351,
      "GGGC": 352,
      "TCCCA": 353,
      "TCCATT": 354,
      "CTGAAA": 355,
      "CTTTA": 356,
      "TCGA": 357,
      "GTTTA": 358,
      "CAACAA": 359,
      "CTTCC": 360,
      "GCCTCC": 361,
      "TTAAA": 362,
      "GCTCTG": 363,
      "GTTTCA": 364,
      "GGAGGA": 365,
      "CGTGA": 366,
      "CAGTC": 367,
      "GAATA": 368,
      "CAGAGA": 369,
      "CCCTC": 370,
      "CAAATG": 371,
      "CTGCTG": 372,
      "GATCC": 373,
      "TTTTATT": 374,
      "AAAATT": 375,
      "TTATA": 376,
      "TCAATT": 377,
      "GGTAA": 378,
      "GTTATT": 379,
      "GCCAGG": 380,
      "GGAGAA": 381,
      "CATTTG": 382,
      "TCACC": 383,
      "CTCAAA": 384,
      "GGTTA": 385,
      "TCCAAA": 386,
      "TCTATT": 387,
      "GCAGA": 388,
      "CTTCA": 389,
      "TCATCA": 390,
      "CGAGG": 391,
      "TAACA": 392,
      "GTTGTT": 393,
      "CTTATT": 394,
      "CGTCA": 395,
      "TAAGA": 396,
      "TAATTTT": 397,
      "CTGTA": 398,
      "TCCACA": 399,
      "GCTGTG": 400,
      "CGCTG": 401,
      "TCTAAA": 402,
      "GCGA": 403,
      "CAATA": 404,
      "CCACCA": 405,
      "GAACA": 406,
      "CGAAA": 407,
      "CAGATT": 408,
      "TCACA": 409,
      "TTATTTT": 410,
      "TCTCAA": 411,
      "TGACA": 412,
      "CTCCAA": 413,
      "AAAAAAA": 414,
      "TATATG": 415,
      "TCCTCC": 416,
      "TCACTT": 417,
      "TCCAGG": 418,
      "CAAGA": 419,
      "GGCTA": 420,
      "GTGGTG": 421,
      "CGTAA": 422,
      "CGAGA": 423,
      "TGATA": 424,
      "GGATTA": 425,
      "CAACA": 426,
      "CGATT": 427,
      "TGAGAA": 428,
      "CTCCTT": 429,
      "CTCATT": 430,
      "GTTAAA": 431,
      "TCATA": 432,
      "CCTCTG": 433,
      "CTCTA": 434,
      "GCTGAA": 435,
      "CTGGA": 436,
      "TAAGG": 437,
      "CTTAAA": 438,
      "TATTTA": 439,
      "CCACA": 440,
      "CCGG": 441,
      "GTCAAA": 442,
      "TGGAA": 443,
      "CGGAA": 444,
      "TGATGA": 445,
      "GTTCA": 446,
      "TAACAA": 447,
      "GCTGTT": 448,
      "TAAGAA": 449,
      "CTGCC": 450,
      "TTAATT": 451,
      "CCAGA": 452,
      "TCAGAA": 453,
      "GTCATT": 454,
      "CGCTT": 455,
      "GATTAA": 456,
      "CTGATT": 457,
      "GCCACA": 458,
      "GTAATT": 459,
      "TCCAGA": 460,
      "GCCAAA": 461,
      "GTGATT": 462,
      "TAAAATT": 463,
      "CAAGAA": 464,
      "CCACC": 465,
      "TAATCC": 466,
      "GTTCTT": 467,
      "TCCATG": 468,
      "GCTCTT": 469,
      "TGCTG": 470,
      "GGGTA": 471,
      "TTACA": 472,
      "GCCATT": 473,
      "GCACA": 474,
      "GCAATT": 475,
      "TCCCTG": 476,
      "TGTGA": 477,
      "TCGAA": 478,
      "GGACA": 479,
      "GGAATT": 480,
      "GTGGA": 481,
      "CTTCTG": 482,
      "TCCCC": 483,
      "GCCCC": 484,
      "CTTGA": 485,
      "TAATGA": 486,
      "TAAATA": 487,
      "TATATA": 488,
      "CTGCAA": 489,
      "TCATTA": 490,
      "GTATA": 491,
      "TCCCCA": 492,
      "CGTTA": 493,
      "GCAGAA": 494,
      "TGAGTT": 495,
      "CTTTTTT": 496,
      "CGATG": 497,
      "CTTTCA": 498,
      "AAAATG": 499,
      "CAGGTT": 500,
      "CTAATT": 501,
      "CGCCA": 502,
      "TGAAAAA": 503,
      "GTTCC": 504,
      "GTCCTT": 505,
      "GTCCAA": 506,
      "GTTTTTT": 507,
      "CTCTGA": 508,
      "GCGC": 509,
      "GTTGA": 510,
      "TGAATG": 511,
      "CTATA": 512,
      "GCAGTG": 513,
      "CCTTAA": 514,
      "TCACCA": 515,
      "TCACTG": 516,
      "GCCCTG": 517,
      "TAACTT": 518,
      "CAGATG": 519,
      "GTAGG": 520,
      "TCTATA": 521,
      "GAGATT": 522,
      "GTCTA": 523,
      "TTTTAAA": 524,
      "CACATG": 525,
      "TGACC": 526,
      "CACAAA": 527,
      "GTGTA": 528,
      "GGGAGG": 529,
      "GCTTTG": 530,
      "CAAAAAA": 531,
      "GAGGAA": 532,
      "GTTCTG": 533,
      "TTTTTA": 534,
      "GTCTCA": 535,
      "GTTCAA": 536,
      "TCGTG": 537,
      "GCTTAA": 538,
      "GCACC": 539,
      "CTCCTG": 540,
      "TAAATAAA": 541,
      "CTACA": 542,
      "CTTCCA": 543,
      "TCCTCA": 544,
      "CGCAA": 545,
      "GAAAAAA": 546,
      "GCCCA": 547,
      "TCGTT": 548,
      "GTAGA": 549,
      "CTCTCA": 550,
      "GTCCA": 551,
      "TGACTT": 552,
      "TCCCTT": 553,
      "GCCATG": 554,
      "CACACACACACACACA": 555,
      "GTGATG": 556,
      "CCTCTT": 557,
      "GCCAGA": 558,
      "TCCTA": 559,
      "CGTTTT": 560,
      "GTACA": 561,
      "GCATA": 562,
      "GAATTA": 563,
      "TGTGTGTGTGTGTGTG": 564,
      "CCCAGG": 565,
      "GGTTTT": 566,
      "TCAAAAA": 567,
      "TCTATG": 568,
      "CCATA": 569,
      "TGACAA": 570,
      "GGATA": 571,
      "TCAGTG": 572,
      "GTATTTT": 573,
      "GAGATG": 574,
      "GCGTG": 575,
      "CGTCC": 576,
      "TTAAAAA": 577,
      "TAATCA": 578,
      "CAATTA": 579,
      "CCACTG": 580,
      "CGGTT": 581,
      "GTTGAA": 582,
      "TGATTA": 583,
      "CCTTTG": 584,
      "CGGTG": 585,
      "CAGGTG": 586,
      "TCAATG": 587,
      "CTGATG": 588,
      "TCAGGA": 589,
      "GTTTAA": 590,
      "TATTAAA": 591,
      "CTCTTA": 592,
      "GCAGGA": 593,
      "CTCTCC": 594,
      "GAACC": 595,
      "CTTTAA": 596,
      "GGGCC": 597,
      "GTATTA": 598,
      "GCGCC": 599,
      "CCAATT": 600,
      "GCTAAA": 601,
      "TGACTG": 602,
      "GATTTG": 603,
      "GATAAA": 604,
      "TCAGCA": 605,
      "GTTCCA": 606,
      "GAAATA": 607,
      "GACAAA": 608,
      "GAGTC": 609,
      "GCTATT": 610,
      "TCACAA": 611,
      "GAGGTT": 612,
      "TAACC": 613,
      "GAAGGA": 614,
      "GCTCAA": 615,
      "GAAAATT": 616,
      "CCAGCA": 617,
      "GTTTTAA": 618,
      "GTGCC": 619,
      "TGAGGA": 620,
      "CATAAA": 621,
      "GGTCC": 622,
      "TCATTTT": 623,
      "TATTTATT": 624,
      "TAATAAA": 625,
      "GCCTA": 626,
      "CTTTTAA": 627,
      "TAAGTG": 628,
      "TAAGTA": 629,
      "CTGGAA": 630,
      "CACACA": 631,
      "GACAGA": 632,
      "CAACC": 633,
      "GGGAAA": 634,
      "CCAGAA": 635,
      "TCAGTT": 636,
      "TAACTA": 637,
      "CTAAAAA": 638,
      "TGGGTT": 639,
      "TGAGTG": 640,
      "TAAAATG": 641,
      "TATATATATATATATA": 642,
      "GCACTG": 643,
      "GACTC": 644,
      "TACAAA": 645,
      "TAAAAAAA": 646,
      "TCTACA": 647,
      "GTTGTG": 648,
      "TCGCC": 649,
      "CCCAAA": 650,
      "GTCATG": 651,
      "CTGCTT": 652,
      "GGAATG": 653,
      "CTATTA": 654,
      "GATATT": 655,
      "TAGAAA": 656,
      "GGCAGG": 657,
      "GATGAA": 658,
      "GTAGAA": 659,
      "TCCTGA": 660,
      "TAACTG": 661,
      "GCTGGG": 662,
      "GCAATG": 663,
      "GCCCCA": 664,
      "GTTTGA": 665,
      "CATTTA": 666,
      "GTGCA": 667,
      "CTTGAA": 668,
      "GTGGAA": 669,
      "CTTCAA": 670,
      "TAAATTA": 671,
      "GTGGCA": 672,
      "TCCTTA": 673,
      "GGAAAAA": 674,
      "TTTTTTA": 675,
      "CCTGTG": 676,
      "GTAATG": 677,
      "GTGTTA": 678,
      "CTAGG": 679,
      "CAGGCTG": 680,
      "GACACA": 681,
      "GAAAAAAA": 682,
      "TCGC": 683,
      "GTAAAAA": 684,
      "TGTTTA": 685,
      "TCTCTA": 686,
      "GTCCTG": 687,
      "CCAGGA": 688,
      "GAACAA": 689,
      "TAAGTT": 690,
      "TGAGCA": 691,
      "GCTCCA": 692,
      "TAAGCA": 693,
      "CTCATG": 694,
      "GTCTTA": 695,
      "CCCACA": 696,
      "CATATT": 697,
      "GCCTCA": 698,
      "CACTC": 699,
      "CTTCTA": 700,
      "TGATTTT": 701,
      "TCGCA": 702,
      "CCTGTT": 703,
      "GAAGCA": 704,
      "GCAAAAA": 705,
      "GCGGA": 706,
      "CCACAA": 707,
      "GCGCA": 708,
      "CATATA": 709,
      "GACATT": 710,
      "GTTCTA": 711,
      "CAAAATT": 712,
      "GAAAGAAA": 713,
      "CCCGG": 714,
      "TACACA": 715,
      "CCAAAAA": 716,
      "GAGGTG": 717,
      "GGCTCA": 718,
      "CAGTGA": 719,
      "TCCCAA": 720,
      "TATCTT": 721,
      "TGAGTA": 722,
      "TCGTA": 723,
      "TTTTCTT": 724,
      "GTGGGA": 725,
      "GAGCTG": 726,
      "CCCTCC": 727,
      "TAGGTT": 728,
      "TTAGG": 729,
      "TAATATT": 730,
      "CCAGCC": 731,
      "CATCTT": 732,
      "GTCTGA": 733,
      "GTTTCC": 734,
      "CCTGAA": 735,
      "GGAGCA": 736,
      "GAAAATG": 737,
      "TCAGTA": 738,
      "TAACCA": 739,
      "GATGTT": 740,
      "CTGTTA": 741,
      "CATGTT": 742,
      "GGCGG": 743,
      "CATGTG": 744,
      "GGGAGA": 745,
      "CTTTGA": 746,
      "TCTTTCTT": 747,
      "AAAAAAAAA": 748,
      "GGGGTG": 749,
      "CTTTCC": 750,
      "CTTGTT": 751,
      "GCATTA": 752,
      "CCCAGA": 753,
      "CAAATA": 754,
      "TCGGA": 755,
      "CAGCTT": 756,
      "TCACTA": 757,
      "TAATTAA": 758,
      "TAAGGA": 759,
      "GAACTG": 760,
      "GCACAA": 761,
      "GCGTT": 762,
      "GGCTC": 763,
      "TCTTTTA": 764,
      "CCTCCA": 765,
      "GGCAAA": 766,
      "CAGCTG": 767,
      "CTACAA": 768,
      "TACATT": 769,
      "GCTATG": 770,
      "CTTGTG": 771,
      "GAGTCA": 772,
      "GTTATG": 773,
      "CTGCCA": 774,
      "GTCTCC": 775,
      "TGACCA": 776,
      "CACCTG": 777,
      "TATATTA": 778,
      "TGATCA": 779,
      "CAGCAA": 780,
      "GATGTG": 781,
      "GTCTTTT": 782,
      "CTAGAA": 783,
      "GCTACA": 784,
      "CTGGGA": 785,
      "GGGGTT": 786,
      "CAAGTA": 787,
      "CAAGGA": 788,
      "CCCTCA": 789,
      "TAGCC": 790,
      "GTTGGA": 791,
      "GCTATA": 792,
      "TCTGAAA": 793,
      "TATGTT": 794,
      "CCCCTT": 795,
      "GTTGTA": 796,
      "CCCTGA": 797,
      "TGACTA": 798,
      "CAAGCA": 799,
      "CAATAA": 800,
      "GAACTT": 801,
      "CATGAA": 802,
      "CTTATG": 803,
      "CTAATG": 804,
      "TCTAAAA": 805,
      "CCAATG": 806,
      "GAAGTG": 807,
      "CCTCAA": 808,
      "CCCATT": 809,
      "CAGTCA": 810,
      "GAGAGAGAGAGAGAGA": 811,
      "TATGTG": 812,
      "GCAGTGA": 813,
      "TCTCCTT": 814,
      "TCCCAAA": 815,
      "CCATTA": 816,
      "CCAGTG": 817,
      "GCATCA": 818,
      "TCAAATT": 819,
      "GATCTT": 820,
      "GACAGG": 821,
      "GGAGTG": 822,
      "GTAGTA": 823,
      "CAACTT": 824,
      "GAAGTT": 825,
      "CCCCTG": 826,
      "TCTCAAA": 827,
      "GGGTC": 828,
      "GAGCTT": 829,
      "TATGAAA": 830,
      "TATGAA": 831,
      "GACATG": 832,
      "CAAGTG": 833,
      "GATATA": 834,
      "CATCTG": 835,
      "CTGTGA": 836,
      "TAATTTA": 837,
      "GGCAGA": 838,
      "GCGAA": 839,
      "CCTAAA": 840,
      "CCATCA": 841,
      "CACTGA": 842,
      "GGACTA": 843,
      "GACGG": 844,
      "CTCTTTT": 845,
      "CTGTCA": 846,
      "TCTCTCTCTCTCTCTC": 847,
      "TTAATG": 848,
      "GCAGCC": 849,
      "CAAAAAAA": 850,
      "GCACCA": 851,
      "CTATTTT": 852,
      "GAGCAA": 853,
      "CTTGGA": 854,
      "CTGGTG": 855,
      "GAATAA": 856,
      "TCCTTTT": 857,
      "GAAGTA": 858,
      "CAGTAA": 859,
      "CAACCA": 860,
      "CTGTAA": 861,
      "TGATAA": 862,
      "GCAGTT": 863,
      "CACGG": 864,
      "TAAATAA": 865,
      "CTGTTTT": 866,
      "CTACTA": 867,
      "GCTCTA": 868,
      "CGAAAA": 869,
      "CAAGTT": 870,
      "CTTGTA": 871,
      "GAATGA": 872,
      "GAGTGA": 873,
      "GCCTGA": 874,
      "GGTTTG": 875,
      "CCCATG": 876,
      "GGGGAA": 877,
      "GAAGAAA": 878,
      "TGTTA": 879,
      "CAATTTT": 880,
      "TATATTTT": 881,
      "CTCAAAA": 882,
      "GGTGGG": 883,
      "CCGTG": 884,
      "TATTTCA": 885,
      "CCCCAA": 886,
      "TATTTAA": 887,
      "GGCTGA": 888,
      "GGTGTG": 889,
      "CATCAA": 890,
      "CACTCA": 891,
      "TCTCATT": 892,
      "GAATTTT": 893,
      "GAATCA": 894,
      "CAGGAAA": 895,
      "CATACA": 896,
      "TATTTTA": 897,
      "TTATAA": 898,
      "GAGGAAA": 899,
      "CATATG": 900,
      "CTTTCTT": 901,
      "CAACTG": 902,
      "GGGCTG": 903,
      "CCCCCA": 904,
      "TTTGAAA": 905,
      "CATTAAA": 906,
      "CTTAAAA": 907,
      "GACTGA": 908,
      "CAATGA": 909,
      "GGCACA": 910,
      "CCAGTA": 911,
      "GGATGA": 912,
      "GTTTTTG": 913,
      "GCATTTT": 914,
      "GTGCCA": 915,
      "GCAGTA": 916,
      "GCCCTT": 917,
      "TCGTC": 918,
      "GAACTA": 919,
      "GTGGTT": 920,
      "GTGTGA": 921,
      "GTGCTT": 922,
      "CGCTA": 923,
      "GTGTCA": 924,
      "TCTTTA": 925,
      "GCCTTA": 926,
      "CCTATT": 927,
      "CAAAATG": 928,
      "GAACCA": 929,
      "CTCCAGG": 930,
      "GACTCA": 931,
      "CATGAAA": 932,
      "GCTAGG": 933,
      "TGTTAAA": 934,
      "GCGTA": 935,
      "GCACTT": 936,
      "TCTTAAA": 937,
      "TAAGAAA": 938,
      "GGCCTG": 939,
      "TCCCTA": 940,
      "GTGGTA": 941,
      "CTGCTA": 942,
      "GGAGTT": 943,
      "GGTAAA": 944,
      "CAAACAAA": 945,
      "GATATG": 946,
      "TCATGA": 947,
      "GACCTT": 948,
      "TAATATA": 949,
      "GCTAGA": 950,
      "GGACTG": 951,
      "GGCATT": 952,
      "CAGTTA": 953,
      "CCCTAA": 954,
      "CACCTT": 955,
      "GGTGAA": 956,
      "CAGCTA": 957,
      "GTGTTTT": 958,
      "CAACTA": 959,
      "GATCAA": 960,
      "GAGAAAA": 961,
      "TGTGAAA": 962,
      "AAAATA": 963,
      "GATGAAA": 964,
      "CTCTAA": 965,
      "TTACTT": 966,
      "GATCTG": 967,
      "CCACTT": 968,
      "GAGTTA": 969,
      "CAATCA": 970,
      "GGATTACAGG": 971,
      "TTTATTTT": 972,
      "TACATA": 973,
      "TTTTATG": 974,
      "GAGTAA": 975,
      "GCTGAAA": 976,
      "GTACTG": 977,
      "GCTCTC": 978,
      "TATGTA": 979,
      "TGTGTA": 980,
      "TCATAA": 981,
      "GGACTT": 982,
      "TCTCCAA": 983,
      "GCATGA": 984,
      "GACGA": 985,
      "CGCCTG": 986,
      "GACCTG": 987,
      "GGTCTT": 988,
      "CACCAA": 989,
      "GATC": 990,
      "GACCAA": 991,
      "AAAATTA": 992,
      "GTAAATT": 993,
      "CCAGTT": 994,
      "CAGAAAA": 995,
      "TAACAAA": 996,
      "GGTGTT": 997,
      "GAAATTA": 998,
      "TGCCTCA": 999,
      "CCGCC": 1000,
      "CCATTTT": 1001,
      "CTTGCC": 1002,
      "TCTGTA": 1003,
      "CTGGCA": 1004,
      "GGGATG": 1005,
      "CCATGA": 1006,
      "CTACTT": 1007,
      "TAGGTG": 1008,
      "TAAAAATT": 1009,
      "GAAAGAA": 1010,
      "TAAAATA": 1011,
      "CTTTTTG": 1012,
      "GTCAAAA": 1013,
      "GGACAA": 1014,
      "TCTGATT": 1015,
      "CTCTCTT": 1016,
      "TAATTTG": 1017,
      "CTCTTTG": 1018,
      "GGCCTT": 1019,
      "GGATTTT": 1020,
      "CTACTG": 1021,
      "GTTGCA": 1022,
      "GGCTCC": 1023,
      "CTCTGTG": 1024,
      "CTCCAGCC": 1025,
      "TTACAA": 1026,
      "GGACCA": 1027,
      "GGAAGGAA": 1028,
      "TAAAGAA": 1029,
      "TTAGAA": 1030,
      "GTGAAAA": 1031,
      "CTTGCA": 1032,
      "TGGGTG": 1033,
      "GGAGCC": 1034,
      "CCTCTA": 1035,
      "CT": 1036,
      "GGGCTT": 1037,
      "GGCATG": 1038,
      "CTGGTT": 1039,
      "TACAGA": 1040,
      "GATTAAA": 1041,
      "CTCTGTT": 1042,
      "TTATCA": 1043,
      "CTGAAAA": 1044,
      "GTAGTT": 1045,
      "GGGTCA": 1046,
      "GT": 1047,
      "CAGCCA": 1048,
      "GCGTC": 1049,
      "CACTTA": 1050,
      "GTGCTA": 1051,
      "TCTTATT": 1052,
      "GTACTT": 1053,
      "GGTATT": 1054,
      "TAGAGA": 1055,
      "TACATG": 1056,
      "CCACTA": 1057,
      "TGAGAAA": 1058,
      "CAATAAA": 1059,
      "TCCAAAA": 1060,
      "CGTGAA": 1061,
      "GGTCTG": 1062,
      "CTGAATT": 1063,
      "TCAGCC": 1064,
      "CCTCTC": 1065,
      "GTTAAAA": 1066,
      "GGGATT": 1067,
      "TCCTAA": 1068,
      "CACTAA": 1069,
      "GGAGAAA": 1070,
      "CCTTCCTT": 1071,
      "GTTTCTT": 1072,
      "TATCAA": 1073,
      "GATACA": 1074,
      "TAATCCCAGCA": 1075,
      "CCGCA": 1076,
      "TGAAATT": 1077,
      "CGTAAA": 1078,
      "CTCTCTG": 1079,
      "TCTTTTTT": 1080,
      "GTACAA": 1081,
      "CCAAATT": 1082,
      "TGTATTTT": 1083,
      "TCGCTT": 1084,
      "GGGTGA": 1085,
      "GATAGA": 1086,
      "CTTTATT": 1087,
      "TAAACAA": 1088,
      "GTTTATT": 1089,
      "TGAATA": 1090,
      "CTACCA": 1091,
      "GTGTCC": 1092,
      "CCCGA": 1093,
      "TTTATTA": 1094,
      "CTCCAAA": 1095,
      "TTTTTTTTTTTT": 1096,
      "TCATCC": 1097,
      "GAAGCC": 1098,
      "CTAAATT": 1099,
      "CAAATTA": 1100,
      "CCCCAAA": 1101,
      "TCTTCTT": 1102,
      "TAGGAAA": 1103,
      "CACGA": 1104,
      "CATTTTA": 1105,
      "GTGCAA": 1106,
      "TCTCCTG": 1107,
      "TATTTTAA": 1108,
      "GTTTGTT": 1109,
      "GAGCCA": 1110,
      "GGCCAA": 1111,
      "CATTTCA": 1112,
      "CATCCA": 1113,
      "CCTATA": 1114,
      "GACTTA": 1115,
      "TCAAATG": 1116,
      "GTATCA": 1117,
      "TAAATTTT": 1118,
      "CTGAGGCA": 1119,
      "GCCCAA": 1120,
      "GGTTAA": 1121,
      "TATCTG": 1122,
      "TGACAGA": 1123,
      "GGAGAGA": 1124,
      "GCTGCTG": 1125,
      "CCCTTA": 1126,
      "TCCTCTG": 1127,
      "GTAGCA": 1128,
      "CCTGAAA": 1129,
      "CCGAA": 1130,
      "TTTTTAA": 1131,
      "CTATAA": 1132,
      "CCTGTA": 1133,
      "TTACTG": 1134,
      "GTATAA": 1135,
      "GGCGA": 1136,
      "GACTAA": 1137,
      "TCAGAAA": 1138,
      "GTGTGTG": 1139,
      "CAAAGAA": 1140,
      "CCTATG": 1141,
      "GCAGAGA": 1142,
      "CCGTT": 1143,
      "TTTTATTTT": 1144,
      "GGAAGAA": 1145,
      "TTACTA": 1146,
      "GCCTGGG": 1147,
      "TCCCTC": 1148,
      "TCCTCTT": 1149,
      "GGATCA": 1150,
      "GGTCAA": 1151,
      "TCGAGA": 1152,
      "TATTCTT": 1153,
      "TACTC": 1154,
      "GTTAATT": 1155,
      "GCGAGA": 1156,
      "CTTAATT": 1157,
      "TCCTTTG": 1158,
      "GTCTAA": 1159,
      "CACCCA": 1160,
      "GGGTTA": 1161,
      "GGGCAA": 1162,
      "GGAAATG": 1163,
      "GCAAATT": 1164,
      "TAGATG": 1165,
      "GCAGAAA": 1166,
      "AAAAAAAAAAAAAAAA": 1167,
      "CCTACA": 1168,
      "GGAGTA": 1169,
      "TCTAATT": 1170,
      "CAACAAA": 1171,
      "TAGATT": 1172,
      "GGTTTA": 1173,
      "CCTAGA": 1174,
      "CTTTAAA": 1175,
      "TACTTA": 1176,
      "TAATGAA": 1177,
      "CTATCA": 1178,
      "TAGTAA": 1179,
      "CAGAGAA": 1180,
      "CAAGAAA": 1181,
      "GGGGAAA": 1182,
      "CGTTAA": 1183,
      "CGTGTT": 1184,
      "TCTGTCTG": 1185,
      "TTTTAATT": 1186,
      "CTGGCC": 1187,
      "TAAATGA": 1188,
      "CGTCAA": 1189,
      "TTAGTA": 1190,
      "GTCTCTG": 1191,
      "TTTTAAAA": 1192,
      "CAGTTTT": 1193,
      "CTTCCTT": 1194,
      "TATATAA": 1195,
      "GCTTTTA": 1196,
      "TTTTTCA": 1197,
      "GGTC": 1198,
      "TTATTAA": 1199,
      "TTTTGTT": 1200,
      "CATAGA": 1201,
      "TAGGAA": 1202,
      "GAGAGAA": 1203,
      "GTAGCTG": 1204,
      "TTATGA": 1205,
      "GTAGTG": 1206,
      "GGAGAGG": 1207,
      "CTCTGAA": 1208,
      "TAGTC": 1209,
      "GACTCC": 1210,
      "TCCCTCC": 1211,
      "TAATGTT": 1212,
      "CATCTA": 1213,
      "GCCACCA": 1214,
      "GTACTA": 1215,
      "TGGGAAA": 1216,
      "CGCCTT": 1217,
      "GCCCGG": 1218,
      "GGAGGAA": 1219,
      "GTACCA": 1220,
      "CGCAAA": 1221,
      "CATAAAA": 1222,
      "TAACATT": 1223,
      "GCTAAAA": 1224,
      "TCTTCTG": 1225,
      "GCCAAAA": 1226,
      "GTATGA": 1227,
      "GTCTTTG": 1228,
      "TACTGA": 1229,
      "TCCCAGG": 1230,
      "TTATTTA": 1231,
      "TTAGTT": 1232,
      "GGACC": 1233,
      "TATAAAA": 1234,
      "CAAACAA": 1235,
      "CTTCTC": 1236,
      "TCTATCTA": 1237,
      "GAAATAA": 1238,
      "GTGTAA": 1239,
      "CTTTGTT": 1240,
      "GATAAAA": 1241,
      "GCCCAGG": 1242,
      "GCGATT": 1243,
      "AAAAAATT": 1244,
      "TACAGG": 1245,
      "GGCTAA": 1246,
      "TAGCTT": 1247,
      "GTCTCTA": 1248,
      "CTCCTGA": 1249,
      "GAATAAA": 1250,
      "TTACCA": 1251,
      "GGGACA": 1252,
      "GCCACTG": 1253,
      "GTTTAAA": 1254,
      "GTCTGTG": 1255,
      "TGACAAA": 1256,
      "TACATTTT": 1257,
      "GCCACC": 1258,
      "TGTTTT": 1259,
      "TAGCAA": 1260,
      "TTATAAA": 1261,
      "GACCCA": 1262,
      "GCAGC": 1263,
      "CAGACAGA": 1264,
      "CACAAAA": 1265,
      "GCCCTA": 1266,
      "TATTAAAA": 1267,
      "CGTATT": 1268,
      "CCATCC": 1269,
      "TCGATT": 1270,
      "GAAGGAA": 1271,
      "GATCCA": 1272,
      "TATTTGA": 1273,
      "GTGAATT": 1274,
      "TACCTT": 1275,
      "CGTCTT": 1276,
      "CCTAGG": 1277,
      "TCGAAA": 1278,
      "CTTTCTG": 1279,
      "TGAAGAA": 1280,
      "TCTCTCA": 1281,
      "GTCTCTT": 1282,
      "GGAGGGG": 1283,
      "GTCTGTT": 1284,
      "CTATGA": 1285,
      "GGAAATT": 1286,
      "GCACACA": 1287,
      "GCCTTTT": 1288,
      "CAGTCC": 1289,
      "CTGGTA": 1290,
      "GCATCC": 1291,
      "TAGTTA": 1292,
      "GGCTTA": 1293,
      "GAGTCC": 1294,
      "TGAAAA": 1295,
      "TAGATAGA": 1296,
      "TGTTTGTT": 1297,
      "TACTCA": 1298,
      "CATTTAA": 1299,
      "GATTTTA": 1300,
      "CACTCC": 1301,
      "GAAACAA": 1302,
      "GCGCTG": 1303,
      "TCTTTCA": 1304,
      "CTGTCC": 1305,
      "GAACTCA": 1306,
      "CGGAAA": 1307,
      "TATTGTT": 1308,
      "GCACTA": 1309,
      "TATTCAA": 1310,
      "GCGGGG": 1311,
      "GTGGCC": 1312,
      "TAATTAAA": 1313,
      "TACTAA": 1314,
      "GCGGTG": 1315,
      "TACCAA": 1316,
      "GGTATA": 1317,
      "CTAGTT": 1318,
      "GCAGAGG": 1319,
      "CTTTTTTTT": 1320,
      "TTTTTTTTTTTTTTTT": 1321,
      "TACAGTA": 1322,
      "CCATGTT": 1323,
      "TAGTGA": 1324,
      "CGTGTG": 1325,
      "GCTCTGA": 1326,
      "CTTCCTG": 1327,
      "TCGCTG": 1328,
      "TAAATCA": 1329,
      "TCCAATT": 1330,
      "GTTTCTG": 1331,
      "GAAGAGA": 1332,
      "GGGTAA": 1333,
      "CCATAA": 1334,
      "TTATATT": 1335,
      "CGAATT": 1336,
      "CCGGA": 1337,
      "TGAGCC": 1338,
      "CCGTA": 1339,
      "CAGAGGA": 1340,
      "GTGTTTG": 1341,
      "GACAAAA": 1342,
      "TTTTTTAAA": 1343,
      "GTTGCC": 1344,
      "GAGTTTT": 1345,
      "TCAAAAAA": 1346,
      "TGTTTCA": 1347,
      "TATCTA": 1348,
      "TCTCTCC": 1349,
      "CTCCACA": 1350,
      "TAAATATT": 1351,
      "TTTTCTG": 1352,
      "CTCTCAA": 1353,
      "CCTTAAA": 1354,
      "TCTTTTAA": 1355,
      "GAACAAA": 1356,
      "TTAGCA": 1357,
      "GCTCATG": 1358,
      "TAAAGTA": 1359,
      "GGATAA": 1360,
      "TTATTAAA": 1361,
      "CTCCATT": 1362,
      "TCTCTGA": 1363,
      "TTATTTG": 1364,
      "CCTGTAA": 1365,
      "TTATATA": 1366,
      "GACTTTT": 1367,
      "TGTTGTT": 1368,
      "GCAAATG": 1369,
      "CTTCAAA": 1370,
      "GAATATT": 1371,
      "GAATCC": 1372,
      "CTCTTAA": 1373,
      "GCATAA": 1374,
      "GAATGAA": 1375,
      "CTTAAAAA": 1376,
      "TAAAAATG": 1377,
      "TTTTAAAAA": 1378,
      "CTCTGGG": 1379,
      "TGATCC": 1380,
      "GCTCTCA": 1381,
      "CTCCAGA": 1382,
      "GAGTGCAGTG": 1383,
      "CAATATT": 1384,
      "TAGAAAA": 1385,
      "GTAAATG": 1386,
      "TAGCTG": 1387,
      "GCTCAAA": 1388,
      "GCAGGAA": 1389,
      "TACCTG": 1390,
      "GGGAAAA": 1391,
      "TTTTCTA": 1392,
      "GGGGGGGG": 1393,
      "CCGA": 1394,
      "CTTTGAA": 1395,
      "GGAGGTG": 1396,
      "TAGTCA": 1397,
      "GGCCCA": 1398,
      "TGATGTT": 1399,
      "CAAATAA": 1400,
      "TCTTCCA": 1401,
      "GCGCTT": 1402,
      "GTATTTG": 1403,
      "GTCTC": 1404,
      "GAAATCA": 1405,
      "TGATAAA": 1406,
      "CATTCTT": 1407,
      "TATCCA": 1408,
      "GCCTCTG": 1409,
      "TGAGATG": 1410,
      "CGCCAA": 1411,
      "GTTTTATT": 1412,
      "TATATATT": 1413,
      "GTAGGA": 1414,
      "GACAGAA": 1415,
      "CTCCAGCCTGGG": 1416,
      "GCGTGA": 1417,
      "GGTATG": 1418,
      "GAGGGAGG": 1419,
      "TCATTTG": 1420,
      "CTACC": 1421,
      "TACAGAA": 1422,
      "GGTAGA": 1423,
      "GATCTA": 1424,
      "GTCCATG": 1425,
      "TGAGGAA": 1426,
      "TAATAAAA": 1427,
      "TAAACTT": 1428,
      "TCACATT": 1429,
      "GGAGGCC": 1430,
      "TCACAAA": 1431,
      "CACTTTT": 1432,
      "CGGCC": 1433,
      "CAACAGA": 1434,
      "GTAGAGA": 1435,
      "GTTATTTT": 1436,
      "CGTTTG": 1437,
      "TCGTCA": 1438,
      "TCTGCTG": 1439,
      "CAACACA": 1440,
      "GGTAGG": 1441,
      "GCAGCTG": 1442,
      "TAGTAGAGA": 1443,
      "CAAGCC": 1444,
      "GCATTTG": 1445,
      "TAATATG": 1446,
      "GCTTAAA": 1447,
      "GCTTCTG": 1448,
      "CTCTCCA": 1449,
      "TCATCTT": 1450,
      "CGTCTG": 1451,
      "TCATTTA": 1452,
      "CATAGG": 1453,
      "GCTCCTT": 1454,
      "TGTTCTT": 1455,
      "TACATTA": 1456,
      "CACAGAA": 1457,
      "TAAATATA": 1458,
      "TAGAGG": 1459,
      "GATAGG": 1460,
      "TCCTGAA": 1461,
      "GGAGCTG": 1462,
      "TGATATT": 1463,
      "TCATTAA": 1464,
      "CTTTTAAA": 1465,
      "TCGTTA": 1466,
      "TAAACTA": 1467,
      "GTTTGAA": 1468,
      "TAAAATTA": 1469,
      "CACCCC": 1470,
      "TCAGAGA": 1471,
      "CTCCTGCCTCA": 1472,
      "TGACATT": 1473,
      "GTATTTA": 1474,
      "CTTCATT": 1475,
      "GAAACTG": 1476,
      "TAACACA": 1477,
      "GTTCAAA": 1478,
      "GGAGATG": 1479,
      "TCGGCC": 1480,
      "CAGCATT": 1481,
      "TCGATG": 1482,
      "TATTCTA": 1483,
      "CTGTGAA": 1484,
      "TATTGAA": 1485,
      "TTTTCCA": 1486,
      "TATTTCTT": 1487,
      "GGTGAAA": 1488,
      "CTGAGAA": 1489,
      "GCACAGA": 1490,
      "GCGAGG": 1491,
      "CTGTGTG": 1492,
      "TGAAATG": 1493,
      "TGATGAA": 1494,
      "GTCCAAA": 1495,
      "CTCAATT": 1496,
      "TCCAGAA": 1497,
      "GTATATA": 1498,
      "TAAAGTT": 1499,
      "TCTCAAAA": 1500,
      "TCCATCA": 1501,
      "GTCTGAA": 1502,
      "TGAGAGA": 1503,
      "TGATTTG": 1504,
      "TTAGCC": 1505,
      "CTCCATG": 1506,
      "TCCCTGA": 1507,
      "GAGCTA": 1508,
      "CCCCCCCC": 1509,
      "GTGGAAA": 1510,
      "CTGGGAA": 1511,
      "CAATGAA": 1512,
      "CCACACA": 1513,
      "CTTTCAA": 1514,
      "CGGAGG": 1515,
      "TCGTGA": 1516,
      "CCAGAAA": 1517,
      "GTTTTAAA": 1518,
      "TGTTGAA": 1519,
      "TCCTGTG": 1520,
      "CTAAATG": 1521,
      "TCCTTTA": 1522,
      "GTCTGGG": 1523,
      "TCTCTTTT": 1524,
      "TACGG": 1525,
      "TATTGTA": 1526,
      "TTAGTG": 1527,
      "TTACC": 1528,
      "TAATCCCAGCACTTTG": 1529,
      "TCTGGAA": 1530,
      "CTTCTCA": 1531,
      "CGCATT": 1532,
      "TATTTAAA": 1533,
      "TCACACA": 1534,
      "TAATCAA": 1535,
      "GCGAAA": 1536,
      "GGGCCA": 1537,
      "GTTCATT": 1538,
      "GAGAAAAA": 1539,
      "TTTTGTA": 1540,
      "TACTTTT": 1541,
      "TCGAGG": 1542,
      "GTGAAAAA": 1543,
      "CAATATA": 1544,
      "TCCCATG": 1545,
      "CAATTAA": 1546,
      "CTGGAAA": 1547,
      "CCCAGCA": 1548,
      "TCCCATT": 1549,
      "TCCTGTT": 1550,
      "CTCTTTA": 1551,
      "TCCCCTT": 1552,
      "GTTTCAA": 1553,
      "GTCCAGG": 1554,
      "GGAAGGA": 1555,
      "TAGTTTT": 1556,
      "TGACCTT": 1557,
      "GTGCTGGGATTACAGG": 1558,
      "TATTTATA": 1559,
      "TCTGCAA": 1560,
      "CTGAAAAA": 1561,
      "TATGTTA": 1562,
      "CTTCACA": 1563,
      "GCACAGG": 1564,
      "CCTGCTG": 1565,
      "TTTTTTAA": 1566,
      "GTTATTA": 1567,
      "CCCTTTT": 1568,
      "TGATTTA": 1569,
      "TACAAAA": 1570,
      "TAAGTAA": 1571,
      "TTTTTAAA": 1572,
      "CATCTC": 1573,
      "GTGGTGA": 1574,
      "GTGGAGA": 1575,
      "CTCTGCA": 1576,
      "GTTAAAAA": 1577,
      "TACATACA": 1578,
      "CTTTGTG": 1579,
      "GGACACA": 1580,
      "TCTGATG": 1581,
      "TATTATT": 1582,
      "TCTTCTA": 1583,
      "CTGTGTT": 1584,
      "TCAGCTT": 1585,
      "CTTTATA": 1586,
      "GGCGC": 1587,
      "TCCCTCA": 1588,
      "GTACC": 1589,
      "TGGAGAA": 1590,
      "CAAAAATT": 1591,
      "TCTTTAA": 1592,
      "CTCTCTC": 1593,
      "TGAGTGA": 1594,
      "GCAGCTT": 1595,
      "CGGATT": 1596,
      "TACGA": 1597,
      "TCTTGTT": 1598,
      "TCGTAA": 1599,
      "GCCTGTG": 1600,
      "TATTCTG": 1601,
      "GGGATA": 1602,
      "GGGTCC": 1603,
      "TGAGATT": 1604,
      "CTTTTATT": 1605,
      "TCCCACA": 1606,
      "CATGGTG": 1607,
      "TTAGGA": 1608,
      "GAACACA": 1609,
      "TCATAAA": 1610,
      "CAACATT": 1611,
      "GGTCCA": 1612,
      "GAATTTG": 1613,
      "TATTAATT": 1614,
      "TCCTGGG": 1615,
      "GCAGCAA": 1616,
      "CTCTTCA": 1617,
      "GAAGAGG": 1618,
      "TCTGTCA": 1619,
      "CTGAATG": 1620,
      "CCACAAA": 1621,
      "GTGGAGG": 1622,
      "TGATTAA": 1623,
      "CTCCCTCC": 1624,
      "CACACACACACACACACACACACACACACACA": 1625,
      "GCGATG": 1626,
      "CATTCTG": 1627,
      "GTAGAAA": 1628,
      "TCATCAA": 1629,
      "TTTTCAA": 1630,
      "TATGTATG": 1631,
      "CCAAATG": 1632,
      "TAATTTTA": 1633,
      "TAAGGAA": 1634,
      "CTTGAAA": 1635,
      "AAAAAAAAAAAA": 1636,
      "GCTCCTG": 1637,
      "GCAGATG": 1638,
      "GAAAAATT": 1639,
      "GACGC": 1640,
      "GTGGGGG": 1641,
      "GTCAATT": 1642,
      "CTTGCTT": 1643,
      "TGACACA": 1644,
      "GTGTGTT": 1645,
      "CCAGAGA": 1646,
      "CCCAGCC": 1647,
      "TAAAGAAA": 1648,
      "GTCCATT": 1649,
      "TAAATTAA": 1650,
      "CCCAAAA": 1651,
      "GAATTAA": 1652,
      "TGAATTA": 1653,
      "TTTTTTTG": 1654,
      "CCAGCTT": 1655,
      "CAATTTG": 1656,
      "CTGTTTG": 1657,
      "GTCTCAA": 1658,
      "GTTTGTG": 1659,
      "GGCATA": 1660,
      "GGTACA": 1661,
      "TGATGTG": 1662,
      "GATTTCA": 1663,
      "TCTGCTT": 1664,
      "GTAATTA": 1665,
      "TAAAAAAAA": 1666,
      "GCCGCC": 1667,
      "TGTGTGTGTGTGTGTGTGTGTGTGTGTGTGTG": 1668,
      "GCGTCA": 1669,
      "GCTCATT": 1670,
      "GAACCTG": 1671,
      "TAAACAAA": 1672,
      "GTGCTGA": 1673,
      "TCAGGAA": 1674,
      "TCCTCAA": 1675,
      "TCTATTTT": 1676,
      "TCTGTTTT": 1677,
      "CAGAGCA": 1678,
      "CCAGGAA": 1679,
      "GTCTTTA": 1680,
      "TCTTCAA": 1681,
      "TCAAAATT": 1682,
      "GCTTATT": 1683,
      "GTTCCTT": 1684,
      "CACCTA": 1685,
      "TCACTGA": 1686,
      "GAAGCAA": 1687,
      "TAAAGA": 1688,
      "TCCTTCA": 1689,
      "TCTCATG": 1690,
      "TCAGTGA": 1691,
      "TACACAA": 1692,
      "CACGTG": 1693,
      "CCTAAAA": 1694,
      "GCCTTTG": 1695,
      "GGCTTTT": 1696,
      "GTTGAAA": 1697,
      "GTTCTC": 1698,
      "CTAGA": 1699,
      "CTACAAA": 1700,
      "GCACAAA": 1701,
      "TTACATT": 1702,
      "GGCCCC": 1703,
      "TAATGTG": 1704,
      "CTGCCTT": 1705,
      "TCCCAGA": 1706,
      "GTGAATG": 1707,
      "GGACAGG": 1708,
      "GGATGTG": 1709,
      "GTTTATA": 1710,
      "TGACCAA": 1711,
      "GTGGCTG": 1712,
      "GTTCTCA": 1713,
      "CTTATTTT": 1714,
      "CTGGAGA": 1715,
      "TTACAAA": 1716,
      "GTCTTCA": 1717,
      "CAAGAGA": 1718,
      "CCATTTG": 1719,
      "TCACAGA": 1720,
      "CTAGTA": 1721,
      "CATTATT": 1722,
      "TTAGA": 1723,
      "GCTCTCC": 1724,
      "GCGCCA": 1725,
      "TATGTTTT": 1726,
      "TCCTCCA": 1727,
      "CAGAAAAA": 1728,
      "GTGGGAA": 1729,
      "TAATCTT": 1730,
      "TGAGTCA": 1731,
      "CTGCTC": 1732,
      "GTCTCCA": 1733,
      "TCATGTT": 1734,
      "GTTTCCA": 1735,
      "TAAGCAA": 1736,
      "CTAAAAATA": 1737,
      "TGACTGA": 1738,
      "TCGGTT": 1739,
      "TTAGAAA": 1740,
      "TAAGCC": 1741,
      "TAAAGCA": 1742,
      "CCTCTCC": 1743,
      "CCTCCTT": 1744,
      "TCAGATT": 1745,
      "TATGAAAA": 1746,
      "GCTGATG": 1747,
      "CATATTTT": 1748,
      "GCTCCAA": 1749,
      "CGGCGG": 1750,
      "CCACTGA": 1751,
      "CAGCAAA": 1752,
      "CTGTCTT": 1753,
      "CTAGCA": 1754,
      "TCGGGG": 1755,
      "CACAGCA": 1756,
      "GCTGATT": 1757,
      "CTAGGA": 1758,
      "TAACTC": 1759,
      "TCATATT": 1760,
      "CCTTCTT": 1761,
      "CTGCAAA": 1762,
      "CCCGC": 1763,
      "GGTCTA": 1764,
      "CCCAGGA": 1765,
      "GTGTCTG": 1766,
      "TAATAATAATAA": 1767,
      "TCACATG": 1768,
      "CAATTTA": 1769,
      "TATATATATATATATATATATATATATATATA": 1770,
      "CCACAGA": 1771,
      "TCAATTTT": 1772,
      "GTATTAA": 1773,
      "GAACATT": 1774,
      "TCTCTTA": 1775,
      "CTATTTG": 1776,
      "TCTTTCC": 1777,
      "GGTTAAA": 1778,
      "GCTAATT": 1779,
      "CTGCTGA": 1780,
      "TACCTA": 1781,
      "CAGGGTT": 1782,
      "TCGCCA": 1783,
      "CAAAAATTA": 1784,
      "CTTCTGA": 1785,
      "GCATGTG": 1786,
      "CTATTAA": 1787,
      "GCACATG": 1788,
      "CAACATG": 1789,
      "TCATGAA": 1790,
      "GAATGTT": 1791,
      "GGGTTTT": 1792,
      "CTGCCTG": 1793,
      "GTCCACA": 1794,
      "TAAACA": 1795,
      "CTCTGGA": 1796,
      "GACCCC": 1797,
      "GGCAAAA": 1798,
      "TCTGTTA": 1799,
      "CTAGTG": 1800,
      "CTATATA": 1801,
      "TCAGTCA": 1802,
      "TAACTAA": 1803,
      "GAAGATG": 1804,
      "GTCTTAA": 1805,
      "CAAGGAA": 1806,
      "GTAAAAAA": 1807,
      "TCCCCTG": 1808,
      "TCGCAA": 1809,
      "TCTGCCTG": 1810,
      "CCTTTTA": 1811,
      "GTCCCAGCTA": 1812,
      "TATATATG": 1813,
      "TATTGTG": 1814,
      "TGTGTTTT": 1815,
      "GCGCAA": 1816,
      "CACAGTG": 1817,
      "TAAGATT": 1818,
      "CTCTGTA": 1819,
      "GGAGGCTGA": 1820,
      "GGACAAA": 1821,
      "TATTAAAAA": 1822,
      "TCGTCC": 1823,
      "TCGGAA": 1824,
      "CTATAAA": 1825,
      "CTTCAGA": 1826,
      "CTAGAAA": 1827,
      "CATTCAA": 1828,
      "CACGCA": 1829,
      "CAGGATT": 1830,
      "CCATCTT": 1831,
      "GTAGCC": 1832,
      "GAATTTA": 1833,
      "CACGC": 1834,
      "CAATCC": 1835,
      "TGAGCAA": 1836,
      "GAAGCTG": 1837,
      "TCAATTA": 1838,
      "GAAGTCA": 1839,
      "CTGCACA": 1840,
      "CCACGG": 1841,
      "GGATCTT": 1842,
      "CTCCTGCCTCAGCCTCC": 1843,
      "TAAATGAA": 1844,
      "CCGTC": 1845,
      "TCGGTG": 1846,
      "TTTTATTA": 1847,
      "GCAGGGG": 1848,
      "GCAGGTG": 1849,
      "TCTATTA": 1850,
      "TAACTTA": 1851,
      "CTAATTTT": 1852,
      "CCCGCC": 1853,
      "TAATACA": 1854,
      "GGATTAAA": 1855,
      "TCTCTCTG": 1856,
      "GCTTCTT": 1857,
      "CATTTATT": 1858,
      "CCAGAGG": 1859,
      "GGACAGA": 1860,
      "GCCAATT": 1861,
      "TCCCCAA": 1862,
      "GTTGATT": 1863,
      "GAAGAAAA": 1864,
      "GCATTTA": 1865,
      "CTCTAAA": 1866,
      "CACACACACACA": 1867,
      "CCTCAAA": 1868,
      "TATAATT": 1869,
      "CAATGTT": 1870,
      "GCCCAGA": 1871,
      "GTATATT": 1872,
      "CTAAAAAA": 1873,
      "CCACAGG": 1874,
      "TAAGAGA": 1875,
      "TCCTTAA": 1876,
      "TATTTTTT": 1877,
      "GAATATA": 1878,
      "GGATTTG": 1879,
      "GTGTGAA": 1880,
      "CTGGCTT": 1881,
      "GCGGCA": 1882,
      "TCCGCC": 1883,
      "GCATCTT": 1884,
      "TCTAATA": 1885,
      "CTGCATT": 1886,
      "CTCTGCC": 1887,
      "TCACTCA": 1888,
      "TCAGCAA": 1889,
      "TATTATG": 1890,
      "CCAGCTG": 1891,
      "GATCTC": 1892,
      "GCCTCTT": 1893,
      "CTTCCAA": 1894,
      "TCCTAAA": 1895,
      "TCATCTG": 1896,
      "CTATTTA": 1897,
      "CTGCAGG": 1898,
      "CAAGCAA": 1899,
      "GCGGAA": 1900,
      "GAAATAAA": 1901,
      "TAAAATAA": 1902,
      "TCACCTT": 1903,
      "CCATGTG": 1904,
      "GACCTA": 1905,
      "CAGATGA": 1906,
      "GTGGCTT": 1907,
      "TTATTATTATTA": 1908,
      "TCCCGG": 1909,
      "TATTTGTT": 1910,
      "CTGTAAA": 1911,
      "TCCATCCA": 1912,
      "CTGTATA": 1913,
      "GTTTCTA": 1914,
      "GTTGCTT": 1915,
      "CCATGAA": 1916,
      "GCTCTTA": 1917,
      "CTTCATG": 1918,
      "GTTCCTG": 1919,
      "GCTGGGA": 1920,
      "TCAGAGG": 1921,
      "CATTAAAA": 1922,
      "TCAGTAA": 1923,
      "GAATGTG": 1924,
      "CTTATTA": 1925,
      "GCACTGA": 1926,
      "TGAGGTT": 1927,
      "CATCAAA": 1928,
      "CTTCTCC": 1929,
      "GTTTATG": 1930,
      "CTTTCCA": 1931,
      "GTGCCTG": 1932,
      "GAAAGGA": 1933,
      "GCATCTG": 1934,
      "TACCCA": 1935,
      "TAACAGA": 1936,
      "AAAAAAAAAAA": 1937,
      "CTATGAA": 1938,
      "CAGTAAA": 1939,
      "TAGCTA": 1940,
      "TCGTTTT": 1941,
      "GTGTCTT": 1942,
      "GAGCAAA": 1943,
      "TCTAAAAA": 1944,
      "GTTCACA": 1945,
      "GAAATGA": 1946,
      "CAAATGA": 1947,
      "GCCCTGA": 1948,
      "GTGTTTA": 1949,
      "TCATGTG": 1950,
      "CATATTA": 1951,
      "TCAAAAAAA": 1952,
      "TAAGTTA": 1953,
      "TCTCTCTT": 1954,
      "CCAGTGA": 1955,
      "CCTCTGA": 1956,
      "CAAGATG": 1957,
      "GCCTGTT": 1958,
      "GTTTGGG": 1959,
      "CATTCATT": 1960,
      "GCCCCTG": 1961,
      "GTTCTGA": 1962,
      "GCGGCC": 1963,
      "GCGGTT": 1964,
      "CAAAACAAAA": 1965,
      "TACATATA": 1966,
      "GAATTAAA": 1967,
      "TCAAGAA": 1968,
      "CTGTATT": 1969,
      "TTTTTATT": 1970,
      "GATTATT": 1971,
      "TCTAATG": 1972,
      "GTTGCTG": 1973,
      "TGAATGAA": 1974,
      "TCAGCTG": 1975,
      "CTTGATT": 1976,
      "CAGAATG": 1977,
      "CTAATTA": 1978,
      "TATAATG": 1979,
      "GTTTTGTTTT": 1980,
      "CCAGCCTG": 1981,
      "TGATGGA": 1982,
      "GCAGATT": 1983,
      "CTCTATT": 1984,
      "GCAGTCA": 1985,
      "TAAGTGA": 1986,
      "CTACACA": 1987,
      "CGCATG": 1988,
      "TAGCCA": 1989,
      "GTGGCTCA": 1990,
      "CAAATAAA": 1991,
      "GTGCTCA": 1992,
      "TTTTTTTTTT": 1993,
      "TAACATG": 1994,
      "TCCCAGCTA": 1995,
      "CAAAGTA": 1996,
      "TCATATA": 1997,
      "CAGCATG": 1998,
      "TGATCTT": 1999,
      "CATAATT": 2000,
      "TGTGTTA": 2001,
      "TTTTGAA": 2002,
      "TTAATTA": 2003,
      "GATATTA": 2004,
      "TCATTCA": 2005,
      "TGATATA": 2006,
      "TGACTCA": 2007,
      "GACGTT": 2008,
      "TGACATG": 2009,
      "GTTGTGA": 2010,
      "CATTTTTT": 2011,
      "GCCTGGA": 2012,
      "CTATGTT": 2013,
      "CTTTGGG": 2014,
      "GTCTCAAA": 2015,
      "CTGGCTG": 2016,
      "CCACATG": 2017,
      "GGCGTG": 2018,
      "CTTAATG": 2019,
      "TAAGATG": 2020,
      "GTATAAA": 2021,
      "TGTATTA": 2022,
      "TAACTCA": 2023,
      "GAGAGAGAGAGAGAGAGAGAGAGAGAGAGAGA": 2024,
      "GCATGAA": 2025,
      "GTTAATG": 2026,
      "TCCAGGA": 2027,
      "GAGAGAAA": 2028,
      "TCTCTGTG": 2029,
      "CTCTCTA": 2030,
      "CCACCTG": 2031,
      "GCCAGGA": 2032,
      "CTGGAGG": 2033,
      "CCATTTA": 2034,
      "GTCTGGA": 2035,
      "GCCCACA": 2036,
      "TAGAGAA": 2037,
      "CAACTCA": 2038,
      "GGCAGGA": 2039,
      "TCTTATG": 2040,
      "CAAAGGA": 2041,
      "GGTAAAA": 2042,
      "GAGAGGA": 2043,
      "GTCCAGA": 2044,
      "GCCCTCA": 2045,
      "GATATTTT": 2046,
      "CAGGGAA": 2047,
      "CCACATT": 2048,
      "GAGGAGG": 2049,
      "GAAACTT": 2050,
      "CAGAATT": 2051,
      "TCAGATG": 2052,
      "TATTTCC": 2053,
      "TACAGTG": 2054,
      "TGAGCTG": 2055,
      "CCATCTG": 2056,
      "GAGAATG": 2057,
      "TCAACAA": 2058,
      "ATT": 2059,
      "TAACTGA": 2060,
      "TGAGAGG": 2061,
      "CACTGAA": 2062,
      "CCACCTT": 2063,
      "CTGCAGA": 2064,
      "TCACCAA": 2065,
      "TGAGCTT": 2066,
      "CAAAGCA": 2067,
      "GGTTTTA": 2068,
      "CGGGGTT": 2069,
      "TCCAAAAA": 2070,
      "TATGTATA": 2071,
      "CCAGATG": 2072,
      "TCCATTTT": 2073,
      "CTGCTCA": 2074,
      "GATAATT": 2075,
      "CCACCAA": 2076,
      "CTCCTCC": 2077,
      "GAGAATT": 2078,
      "GAAAGTA": 2079,
      "TAAAATAAAA": 2080,
      "CTTCTTA": 2081,
      "CTGTTTA": 2082,
      "GAATCAA": 2083,
      "GCATGTT": 2084,
      "GCACGG": 2085,
      "GACTGAA": 2086,
      "GTGCACA": 2087,
      "GACGTG": 2088,
      "TATACAA": 2089,
      "TCGACA": 2090,
      "GAAGACA": 2091,
      "TAAAGGA": 2092,
      "GATCAAA": 2093,
      "CAGTGTG": 2094,
      "CTAGCC": 2095,
      "GAGGAAAA": 2096,
      "TCTGAAAA": 2097,
      "GAACCCA": 2098,
      "GATGGATG": 2099,
      "GTTCTTA": 2100,
      "CTATATT": 2101,
      "GCATTAA": 2102,
      "TCTCTCTCTCTCTCTCTCTCTCTCTCTCTCTC": 2103,
      "TCAGTC": 2104,
      "TATTTTTG": 2105,
      "GAGGATT": 2106,
      "GTATGTG": 2107,
      "TAACCAA": 2108,
      "GTTGTTTT": 2109,
      "TTTTTCTT": 2110,
      "GTGTTAA": 2111,
      "CTTGGAA": 2112,
      "AAAAAATG": 2113,
      "CAATGTG": 2114,
      "GTGCCTT": 2115,
      "GCCTCAA": 2116,
      "GAGTCTT": 2117,
      "GCTAATTTT": 2118,
      "CGAAAAA": 2119,
      "GTGTATA": 2120,
      "GCGTTA": 2121,
      "CTGCACTCCAGCCTGGG": 2122,
      "GTTCATG": 2123,
      "CAAAGAAA": 2124,
      "GCAGTAA": 2125,
      "GGATGAA": 2126,
      "CTTTATG": 2127,
      "CAGGAAAA": 2128,
      "TCCTGCA": 2129,
      "CTGTCTG": 2130,
      "GAACATG": 2131,
      "GGATGGA": 2132,
      "GCCTGAA": 2133,
      "CAAAAATG": 2134,
      "TCCAATG": 2135,
      "CCAGCAA": 2136,
      "GGCCTA": 2137,
      "CAACTGA": 2138,
      "GCACCTG": 2139,
      "GTCTATT": 2140,
      "CCTCTCA": 2141,
      "GTGGTCA": 2142,
      "GTGTAAA": 2143,
      "GTACACA": 2144,
      "GTAAAATT": 2145,
      "GTACATT": 2146,
      "TATATAAA": 2147,
      "CTGTTAA": 2148,
      "TAAGTCA": 2149,
      "GCCTCCA": 2150,
      "AAATTAAA": 2151,
      "GTGCAGG": 2152,
      "TCCTGGA": 2153,
      "GTGCAAA": 2154,
      "GCGTCC": 2155,
      "CCATTAA": 2156,
      "GGAGGGA": 2157,
      "TCACTTA": 2158,
      "TCATTAAA": 2159,
      "CAACATA": 2160,
      "TAATAGA": 2161,
      "TAATGTA": 2162,
      "GATTTTTT": 2163,
      "GTTGTCA": 2164,
      "GGAGACA": 2165,
      "GTGTGGG": 2166,
      "TCACAGG": 2167,
      "TCGGCA": 2168,
      "CTCCCTG": 2169,
      "GACCAAA": 2170,
      "TGTTTATT": 2171,
      "CGAATG": 2172,
      "CTCAATG": 2173,
      "TCACCTG": 2174,
      "CAGTGTT": 2175,
      "TGAGACA": 2176,
      "TAGGGG": 2177,
      "GAAAAATG": 2178,
      "GTTGAGA": 2179,
